# SaveAsOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SaveAsOptions Methods
SaveAsOptions Class See Also
---
The SaveAsOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetWorksharingOptions | Gets Worksharing options for SaveAs. |
| SetWorksharingOptions | Sets Worksharing options for SaveAs. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SaveAsOptions Class
Autodesk.Revit.DB Namespace